const data = [
    {
        'id': 1,
        'name': 'Велика книга. Вчимося дружити',
        'autor': 'Євгеній Новицький',
        'img': 'https://nashformat.ua/files/products/velyka-knyga-vchymosya-druzhyty-920242.800x800.jpeg?200514122421',
        'plot': `Що таке дружба? Як чинять справжні друзі? Ця книжка - збірка віршів про дружбу для дітей.
        Усередині ви знайдете добрі і веселі, кумедні й сумні вірші про пригоди різних героїв. 
        Вони розкажуть дитині, що таке дружба і як це - вміти дружити. 
        Слухаючи теплі історії з повсякденного життя героїв, дитина дізнається, 
        як знаходити нових приятелів і ніколи не втрачати старих друзів.`
    },
    {
        'id': 2,
        'name': 'Велика книга. Казки',
        'autor': 'Генадій Маламед',
        'img': 'https://nashformat.ua/files/products/velyka-knyga-kazky-920247.800x800.jpeg?200514122421',
        'plot': `Як перетворити злого чаклуна в доброго чарівника? 
        Що робити принцесі, якщо вона потрапила в лапи людожера або злого розбійника? 
        Що робити ковбоєві, якщо він знайшов стародавній скарб? 
        Це збірка казок у віршах з незвичайним сюжетом. 
        Головні герої — принцеси та пірати, феї та козаки, потрапляють у неймовірні й часом небезпечні ситуації. 
        Це казки про дружбу, щедрість, доброту й оптимізм.`
    },
    {
        'id': 3,
        'name': 'Велика книга. Лічба',
        'autor': 'Ірина Сонечко',
        'img': 'https://nashformat.ua/files/products/velyka-knyga-lichba-920248.270x390.jpeg?200514122421',
        'plot': `Велика книга лічби - це барвиста збірка віршів улюбленої дитячої поетеси Ірини Сонечко. 
        Навчання цифрам, додавання і віднімання дуже важливо для дошкільника. 
        Слухаючи віршики і розглядаючи картинки, ваш малюк із задоволенням буде допомагати звірятам та малятам. 
        Граючи, дитина вивчить рахунок від 1 до 10, додавання і віднімання, рішення перших прикладів і завдань.`
    }
  ];
 localStorage.clear();
 for(let i = 0; i < data.length; i++){
     let item = i + 1;
     if(localStorage.getItem(item) === null){
        localStorage.setItem(item.toString(), JSON.stringify(data[i]));
     }
    
 }




